app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("name", "last_name", "birth_date", "biography", "country", "city", "phone_number", "cell_phone", "blood_type", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @profile = Profile.new(profile_params)
    #add user here
    if @profile.save

UPDATE "profiles" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["image_updated_at", "2016-02-19 03:43:25.219119"], ["image_file_name", "profile-placeholder.jpg"], ["updated_at", "2016-02-19 03:43:25.235720"], ["id", 11]]
---
  def update
    if @profile.update(profile_params)